---
type: Fascia
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 3
tags: [revit-api, class]
---

# Fascia

`Autodesk.Revit.DB.Architecture.Fascia` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSegment | — | `public override void AddSegment ( Reference targetRef )` |
| Property | FasciaType | — | `public FasciaType FasciaType { get ; set ; }` |
| Property | Parameter | — | `` |